# TransactionAttribute Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionAttribute Class
Members See Also
---
The custom transaction attribute to control the transaction behavior of the external command.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class TransactionAttribute : Attribute
```

Visual Basic
---
```text
Public Class TransactionAttribute _
	Inherits Attribute
```

Visual C++
---
```text
public ref class TransactionAttribute : public Attribute
```

# Inheritance Hierarchy
System..::..Object System..::..Attribute Autodesk.Revit.Attributes..::..TransactionAttribute
# See Also
TransactionAttribute Members
Autodesk.Revit.Attributes Namespace